Repository: MilesChing/ThunderX
Catalog: TX/Resources/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn, zh_hans

# AboutPage_FeedbackInfo_GuideText_1.Text
source: Showing us some love on the store helps us to continue to work on the app and make things even better!
zh_hans: 通过 Windows 商店评价此应用程序以助力开发！

# AboutPage_FeedbackInfo_GuideText_2.Text
source: If you have found a bug within this application, please file an issue on our GitHub repository:
zh_hans: 提交 BUG 或参考源代码，请在我们的 Github 仓库中提交 issue ：

# AboutPage_FeedbackInfo_Title.Text
source: Rating and Feedback
zh_hans: 评价

# AboutPage_LogoText_DevelopedBy.Text
source: Developed by
zh_hans: 开发者

# AboutPage_LogoText_PackageVersion.Text
source: Package Version
zh_hans: 版本号

# AboutPage_Title.Text
source: About
zh_cn: 关于
zh_hans: 关于

# AboutPage_TrailMessage_BuyButton.Content
source: Buy Now
zh_hans: 立即入手

# AboutPage_TrailMessage_Title.Text
source: Still using trial version?
zh_hans: 仍使用试用版本？

# AboutPage_VersionInfo_Title.Text
source: Introducing Version
zh_hans: 版本

source: Creation Time
zh_hans: 创建时间

# DeleteConfirmationFlyout_ConfirmButton.Content
source: Yes, remove it
zh_hans: 删除该任务

# DeleteConfirmationFlyout_GuideText.Text
source: The task together with its temporal file will be removed. Do you want to continue?
zh_hans: 该任务的记录（包括未完成任务的临时文件）都将被删除。是否继续？

source: Downloader Type
zh_hans: 下载器类型

# HistoryListPage_EmptyView_GuideText.Text
source: Right click to open previous downloaded or remove histories.
zh_hans: 在历史记录上右击或长按以打开 或在文件夹中查看。

# HistoryListPage_EmptyView_Title.Text
source: Download History
zh_hans: 历史记录

# HistoryListPage_Selection_Selected.Text
source: Selected
zh_hans: 已选中

# HistoryListPage_Title.Text
source: Download History
zh_hans: 历史记录

# MainPage_NavigationItem_About.Content
source: About
zh_hans: 关于

# MainPage_NavigationItem_Add.Content
source: Create New
zh_hans: 新任务

# MainPage_NavigationItem_List.Content
source: History
zh_hans: 历史记录

# MainPage_NavigationItem_Set.Content
source: Settings
zh_hans: 设置

# NewTaskPage_AcceptButton.Content
source: Create New
zh_hans: 创建

# NewTaskPage_DestinationFolder_Button.Content
source: Select Folder
zh_hans: 选取文件夹

# NewTaskPage_DestinationFolder_Title.Text
source: Destination Folder
zh_hans: 目标文件夹

# NewTaskPage_FileName_CheckBox.Content
source: Custom filename
zh_hans: 使用自定义的文件名

# NewTaskPage_FileName_Title.Text
source: File Name
zh_hans: 文件名

# NewTaskPage_Streams_Title.Text
source: Streams
zh_hans: 文件列表

# NewTaskPage_Title.Text
source: Create new task
zh_hans: 创建新任务

# NewTaskPage_URL_Title.Text
source: URL
zh_hans: 链接

# SetPage_Appearance_DarkModeToggleSwitch.Header
source: Dark Mode
zh_hans: 深色主题

# SetPage_Appearance_Title.Text
source: Appearance
zh_hans: 个性化

# SetPage_Downloader_MaxRetriesSlider.Header
source: Maximum Retries
zh_hans: 最大自动重试次数

# SetPage_Downloader_MemorySlider.Header
source: Memory Upperbound
zh_hans: 内存占用上限

# SetPage_Downloader_ThreadNumSlider.Header
source: Number of Threads
zh_hans: 工作线程数

# SetPage_Downloader_Title.Text
source: Downloader Configurations
zh_hans: 下载器配置

# SetPage_Notifications_TaskCompletedToggleSwitch.Header
source: Task Completion Notification
zh_hans: 有任务完成时发送通知

# SetPage_Notifications_TaskFailedToggleSwitch.Header
source: Task Failed Notification
zh_hans: 有任务失败时发送通知

# SetPage_Notifications_Title.Text
source: Notifications
zh_hans: 通知

# SetPage_Title.Text
source: Settings
zh_cn: 设置
zh_hans: 设置

source: Target Type
zh_hans: 源类型

# TaskListPage_SortDropDownButton.Content
source: Ordered
zh_hans: 排序

# TaskListPage_SortDropDownButton_SortAlphabetically.Text
source: Alphabetically
zh_hans: 按首字母

# TaskListPage_SortDropDownButton_SortByCreationTime.Text
source: By creation time
zh_hans: 按创建时间

# TaskListPage_SortDropDownButton_SortByStatus.Text
source: By status
zh_hans: 按状态

# TaskListPage_Title.Text
source: Tasks
zh_hans: 任务列表

source: Total Size
zh_hans: 文件大小

source: Unknown
zh_cn: 未知
zh_hans: 未知

# HistoryListPage_Flyout_Delete.Text
source: Delete
zh_hans: 删除

# HistoryListPage_Flyout_OpenFile.Text
source: Open File
zh_hans: 打开文件

# HistoryListPage_Flyout_OpenFolder.Text
source: Open Folder
zh_hans: 打开文件夹

# TaskListPage_EmptyView_GuideText.Text
source: Unfinished tasks will be displayed here. Create a task for downloading.
zh_hans: 当前未完成任务将被显示在这里。 创建任务以开始下载！

# TaskListPage_EmptyView_Title.Text
source: Your Tasks Here
zh_hans: 当前没有任务

# TaskDetailPage_Subtitle_Progress.Text
source: Progress
zh_hans: 进程

source: Errors
zh_hans: 错误数

source: Retries
zh_hans: 重试数

source: Speed
zh_hans: 下载速度

source: Available Peers
zh_hans: 可用 Peers

source: Open Connections
zh_hans: 开启连接数

source: Progress
zh_hans: 进度

# TaskDetailPage_CopyItem.Text
source: Copy
zh_hans: 复制

# SetPage_Thunderbolt_Title.Text
source: Thunderbolt Analyzer
zh_hans: Thunderbolt 链接分析

# SetPage_Torrent_MaximumConnectionsSlider.Header
source: Maximum Connections
zh_hans: 最大连接数

# SetPage_Torrent_Title.Text
source: Torrent Downloader
zh_hans: Torrent 下载

# SetPage_YouTube_Title.Text
source: YouTube Analyzer
zh_hans: YouTube 链接提取

# SetPage_Thunderbolt_ToggleSwitch.Header
source: Plugin Enabled
zh_hans: 启用该功能

# SetPage_Torrent_ToggleSwitch.Header
source: Plugin Enabled
zh_hans: 启用该功能

# SetPage_YouTube_ToggleSwitch.Header
source: Plugin Enabled
zh_hans: 启用该功能

# AboutPage_AppDescription.Text
source: The mission of Thunder X is to provide a simple, fast and transparent download experience. Our URL parsing process, which is encapsulated to be transparent to the user, supports different types of resources and protocols. Downloader core of Thunder X is well designed to run with high efficiency and low power consumption. All of this is presented to the user through a simple styled user interface.
zh_hans: Thunder X 定位在于提供简单、快速、透明的文件下载体验。Thunder X 提供对用户完全透明的 URL 解析过程，对特殊链接进行全自动解析和提取，高效和低功耗的下载核心以及简洁极致的交互界面。

# AboutPage_TrailMessage.Text
source: If satisfied with our application, pay to support development teams and to enjoy these features: 🔌 More fantastic plugins including Torrent downloading, YouTube link and Thunderbolt protocol extractor, etc. 🛠 Deep customization of the downloader kernel, support to change the number of threads to get the fastest download speed, limit the memory footprint of whole application core. 🕹 Automatically retry the download when an error occurs. 🚀 Keep downloading in background after Thunder X closed or suspended.
zh_hans: 当前的试用版许可证包含完整 Thunder X 功能，但其使用时间受到限制。如果对应用程序感到满意，获取完整许可证并享受 Thunder X 的后续迭代仅需一次购买！

# NewTaskPage_OtherConfigs_BackgroundAllowedToggleSwitch.Header
source: Allow Downloaded in Background
zh_hans: 允许后台下载

# NewTaskPage_OtherConfigs_Title.Text
source: Other Configurations
zh_hans: 其他设置

source: Remaining Time
zh_hans: 预计剩余

# SetPage_CleanUp_Button.Content
source: Clean Up
zh_hans: 清理

# SetPage_CleanUp_Title.Text
source: Storage Cache Size
zh_hans: 缓存文件大小

# SetPage_CleanUp_GuideText.Text
source: Cache files that are no longer valid are automatically cleaned each time the application is closed. Manual cleanup is often unnecessary.
zh_hans: 失效的缓存文件将在每次应用程序被关闭时被自动清理。一般来说手动进行垃圾清理是不必要的。

# SetPage_BackgroundTask_BackgroundTaskToggleSwitch.Header
source: Enable Downloads in Background
zh_hans: 启用后台下载

# SetPage_BackgroundTask_GuideText.Text
source: If the device is plugged in, Background Task keeps downloading when Thunder X is suspended or closed. It is activated every freshness time and works for 10 minutes each time in background automatically and transparently.
zh_hans: 在设备接通电源时，后台任务将在 Thunder X 已被休眠或关闭后仍以一定频率保持下载。后台任务将每隔一段间隔时间触发一次长约为十分钟的运行。

# SetPage_BackgroundTask_OnlyWhenBackgroundWorkCostNotHighToggleSwitch.Header
source: Only when background cost is not High
zh_hans: 仅当后台占用低时启用

# SetPage_BackgroundTask_OnlyWhenUserNotPresentToggleSwitch.Header
source: Only when User is not present
zh_hans: 仅当设备不在使用时启用

# SetPage_BackgroundTask_Title.Text
source: Background Task
zh_hans: 后台任务

# SetPage_BackgroundTask_FreshnessTimeSlider.Header
source: Freshness Time
zh_hans: 后台间隔时间

# SetPage_Torrent_CustomTrackerListFile_Header.Text
source: Custom Tacker List
zh_hans: 自定义 Tracker 列表

# SetPage_Torrent_CustomTrackerListFile_GuideText.Text
source: Both original trackers embedded in the torrent file and custom trackers imported from custom tracker list file are used by Thunder X torrent downloader. Each line in the file represents an announce URL, edit and reload it to apply your own tracker list.
zh_hans: Thunder X Torrent 下载器同时使用 .torrent 文件中指定的 Tracker 服务器（优先）和从自定义 Tracker 列表文件种读取到的 Tracker 服务器。直接修改自定义 Tracker 列表文件（每行写入一个 Announce URL）并重新加载以增加下载时使用的 Tracker 服务器。

# SetPage_Torrent_CustomTrackerListFile_EditFileItem.Text
source: Edit File
zh_hans: 编辑列表文件

# SetPage_Torrent_CustomTrackerListFile_ReloadItem.Text
source: Reload Tracker List
zh_hans: 重新加载 Tracker 列表

# NewTaskPage_Streams_CheckBox.Content
source: Select All
zh_hans: 选择全部

# NewTaskPage_ClipboardButton_TextBlock.Text
source: Insert from clipboard
zh_hans: 从剪贴板插入

# NewTaskPage_FileButton_TextBlock.Text
source: Pick source file
zh_hans: 选取文件以开始

# Toast_DownloaderCompletion_Downloaded
source: Downloaded
zh_hans: 已下载

# Toast_DownloaderCompletion_Duration
source: In duration
zh_hans: 用时

# Toast_DownloaderCompletion_Open
source: Open
zh_hans: 打开

# Toast_DownloaderCompletion_OpenFolder
source: Open in folder
zh_hans: 在文件夹中打开

# Toast_DownloaderCompletion_TitlePrefix
source: Task Completed:
zh_hans: 任务已完成：

# Toast_DownloaderError_TitlePrefix
source: Task Failed:
zh_hans: 任务出错：

# NewFeaturesFlipView_GuideText.Text
source: Tap anywhere to continue
zh_hans: 点击任意位置即刻开始

# NewTaskPage_YouTubeTeachingTip.ActionButtonContent
source: Purchase Now
zh_hans: 立即入手

# NewTaskPage_YouTubeTeachingTip.CloseButtonContent
source: Later
zh_hans: 下次一定

# NewTaskPage_YouTubeTeachingTip.Subtitle
source: Purchase the full version of Thunder X to unlock the YouTube video URL auto extractor, together with many other downloader plugins as well as full-depth customization to Thunder X core.
zh_hans: 购入完整版本 Thunder X 以解锁自动化 YouTube 链接提取，及更多下载功能和深度定制的 Thunder X 核心。

# NewTaskPage_YouTubeTeachingTip.Title
source: Need YouTube video downloading?
zh_hans: 需要从 YouTube 下载？

# NewTaskPage_TorrentTeachingTip.Subtitle
source: Purchase the full version of Thunder X to unlock downloading either from magnet links or torrent files, together with many other downloader plugins as well as full-depth customization to Thunder X core.
zh_hans: 购入完整版本 Thunder X 以解锁对使用 Magnet 链及 Torrent 文件的 BitTorrent 支持，及更多下载功能和深度定制的 Thunder X 核心。

# NewTaskPage_TorrentTeachingTip.Title
source: Need support for the BitTorrent protocol?
zh_hans: 需要通过 BitTorrent 下载？

# NewTaskPage_TorrentTeachingTip.ActionButtonContent
source: Purchase Now
zh_hans: 立即入手

# NewTaskPage_TorrentTeachingTip.CloseButtonContent
source: Later
zh_hans: 下次一定

# SetPage_Folders_DownloadFolder_Subtitle.Text
source: Download Folder
zh_hans: 下载文件夹

# SetPage_Folders_Title.Text
source: Folders
zh_hans: 目录

# NewTaskPage_OtherConfigs_ScheduleTask_Header.Text
source: Schedule the task
zh_hans: 计划任务

# TaskDetailPage_ScheduledTime_StartsAt.Text
source: Scheduled to start at
zh_hans: 计划开始于

# NewTaskPage_OtherConfigs_ScheduleTask_GuideText.Text
source: A scheduled task will not be automatically started in the background or foreground before its scheduled time.
zh_hans: 计划任务在其计划时间到达前不会被前台的应用程序或后台任务自动启动。

# AboutPageName
source: About
zh_cn: 关于

# AboutPage_Button_Github.Content
source: GOTO Github
zh_cn: 访问我的Github

# AboutPage_Button_Trail.Content
source: Buy the full version
zh_cn: 购买完整版

# AboutPage_GuideText_AboutDeveloper.Text
source: An ordinary student who loves life.
zh_cn: 一名热爱生活的普通肥宅。

# AboutPage_GuideText_Active.Text
source: You are using the full version of Thunder X.
zh_cn: 正在使用完整版Thunder X，感谢支持！

# AboutPage_GuideText_Review.Text
source: Showing us some love on the store helps us to continue to work on the app and make things even better !
zh_cn: 在Windows应用商店中评价我们，助力应用开发!

# AboutPage_GuideText_Trail.Text
source: You are using a trial version. The price of a cup of coffee to unlock all features!
zh_cn: 正在使用试用版本（无限期），解锁全部功能？只要一杯咖啡的价格！

# AboutPage_SubTitle_AboutDeveloper.Text
source: About Developer
zh_cn: 关于开发者

# Connecting
source: Connecting to a remote server
zh_cn: 正在连接远程服务器

source: Download completed
zh_cn: 下载完成

source: Downloader done
zh_cn: 已准备好开始

source: Downloading
zh_cn: 正在下载

# MainPage_AboutButton.Label
source: About
zh_cn: 关于

# MainPage_AddButton.Label
source: Add New
zh_cn: 新增

# MainPage_BrowserButton.Label
source: Browser
zh_cn: 浏览器

# MainPage_SetButton.Label
source: Settings
zh_cn: 设置

# Multithread
source: Multithreading enabled
zh_cn: 已启用多线程模式

# NewTaskPageName
source: Start New
zh_cn: 新增

# NewTaskPage_ComboBox.PlaceholderText
source: Video source
zh_cn: 选择视频源

# NewTaskPage_GuideText_ThreadNum.Text
source: Drag the slider if you need to set the number of threads separately for the task.
zh_cn: 拖动滑块为项目单独设置下载时的线程数。

# NewTaskPage_GuideText_URLBox.Text
source: Fill in the following text box to start a new download task.
zh_cn: 填入链接以新增项目。

# NewTaskPage_NeedRenameCheckBox.Content
source: I need to rename it
zh_cn: 需要重命名

# NewTaskPage_SubmitButton.Content
source: Submit
zh_cn: 提交

# NewTaskPage_Subtitle_Rename.Text
source: Rename
zh_cn: 重命名

# NewTaskPage_Subtitle_ThreadNum.Text
source: Number of threads
zh_cn: 线程数

# NewTaskPage_Title.Text
source: Start New
zh_cn: 新增

source: Parsing completed
zh_cn: 解析成功

source: Parsing failed
zh_cn: 解析失败

source: Pause
zh_cn: 暂停

source: Prediction:
zh_cn: 预计

source: Refreshing
zh_cn: 正在重试

# SetPageName
source: Settings
zh_cn: 设置

# SetPage_GuideText_DefaultFolder.Text
source: Set a folder as the default directory for every download task. Make sure this folder is not moved, deleted, or renamed when you use it.
zh_cn: 将文件夹设置为每个下载任务的默认目录。确保在使用此文件夹时不会移动、删除或重命名该文件夹。

# SetPage_GuideText_MaxRetries.Text
source: We will automatically retry the task for you when certain errors occur. Drag the slider to set an upper number of times.
zh_cn: 在某些错误发生时，我们可以自动为您重试，请为这个行为设置一个上限。

# SetPage_GuideText_ThreadNum.Text
source: Drag the slider below to set the default number of threads. The effect of the number of threads on download speed depends on the device and network environment.
zh_cn: 拖动下面的滑块以设置默认的线程数。线程数对下载速度的影响取决于设备和网络环境。

# SetPage_Subtitle_Appearance.Text
source: Appearance
zh_cn: 外观

# SetPage_Subtitle_DefaultFolder.Text
source: Reset Downloads Folder
zh_cn: 设置默认下载文件夹

# SetPage_Subtitle_MaxRetries.Text
source: Maximum Number of Retries
zh_cn: 重试次数上限

# SetPage_Subtitle_ThreadNum.Text
source: Default Number of threads
zh_cn: 默认线程数

# SetPage_ToggleSwitch_DarkMode.Header
source: Dark Mode
zh_cn: 黑色主题

# SomethingWrong
source: Something goes wrong
zh_cn: 意想不到的事情发生了！

# SuccessfullyConnected
source: Successfully connected to the remote server
zh_cn: 成功连接到目标服务器

# ThunderLinkDetected
source: Thunderbolt link detected
zh_cn: 检测到Thunderbolt链接

# ThunderLinkDetectedButFailed
source: Thunderbolt link detected, but converted content is illegal
zh_cn: 检测到Thunderbolt链接，但转换后的内容非法

# TrailMessage.Text
source: Multithreading mode is not enabled in trail version.
zh_cn: 试用版不支持开启多线程模式。

# UnableToConnect
source: Unable to connect: please check the network connection of the device
zh_cn: 无法连接：请检查设备的网络连接

# WebBrowserPageName
source: Browser
zh_cn: 浏览器

# WebBrowserPage_GuideText_WebResources.Text
source: The following list records all the links we have analyzed from the current page.
zh_cn: 资源列表中记录了我们根据当前页面分析出的文件链接及其资源大小，点按以复制所需链接进行下载。

# WebBrowserPage_SubTitle_WebResources.Text
source: URL List
zh_cn: 资源列表

# YouTubeLinkDetected
source: Youtube link parsed
zh_cn: 已解析YouTube链接

# YouTubeLinkDetectedButFailed
source: Youtube link detected but unable to get the video
zh_cn: 检测到YouTube链接，但解析视频失败

# YouTubeLinkDetectedButWaiting
source: YouTube link detected
zh_cn: 检测到YouTube链接，正在解析
